CSI API ETABS v1
cAreaObj.Delete Method
 Deletes area objects.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int Delete(
	string Name,
	eItemType ItemType = eItemType.Objects
)
Function Delete (
	Name As String,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cAreaObj
Dim Name As String
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.Delete(Name, ItemType)
int Delete(
	String^ Name,
	eItemType ItemType = eItemType::Objects
)
abstract Delete :
        Name : string *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing area object or group, depending on the value of the ItemType item.
ItemType (Optional)
Type: ETABSv1.eItemType
 This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
 If this item is Objects, the area object specified by the Name item is deleted.
 If this item is Group, all of the area objects in the group specified by the Name item are deleted.
 If this item is SelectedObjects, all of the selected area objects are deleted, and the Name item is ignored.
Return Value
Type: Int32
 Returns zero if the area objects are successfully deleted; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'delete area object
   ret = SapModel.AreaObj.Delete("2")
'refresh view
   ret = SapModel.View.RefreshView(0, False)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace